app/controllers/v1/events_controller.rb

    def index
      page_number = params.fetch(:page, '')
      per_page = params.fetch(:per_page, '')
      @events = Event.all.page(page_number).per(per_page)
---
SELECT  `events`.* FROM `events` WHERE (JSON_EXTRACT(body, '$.number' = 1) ORDER BY `events`.`id` ASC LIMIT 1

    def issues
      page_number = params.fetch(:page, '')
      per_page = params.fetch(:per_page, '')
      @events = Event.issue_by_number(params[:number]).page(page_number).per(per_page)
---
SELECT  `events`.* FROM `events` WHERE (body->'$.number' = '5') LIMIT 25 OFFSET 0