app/controllers/v1/webhooks_controller.rb

    def callback
      attributes = { event: event_name, body: params }
      callback = CallbackIssueService.new(attributes)
      return json_response(@events, :internal_server_error) unless callback.valid?

      callback.save
---
INSERT INTO `events` (`body`, `event`, `created_at`, `updated_at`) VALUES ('{\"url\":\"https://google.com.br\"}', 0, '2019-02-07 15:46:46', '2019-02-07 15:46:46')